---
kind: type
id: T:Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo
source: html/279381f9-454a-56d1-392b-c62dd7eea56a.htm
---
# Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo

Specifies boundary condition orientation.

## Syntax (C#)
```csharp
public enum BoundaryConditionsOrientTo
```